// ==UserScript==
// @name         JLPT Kanji
// @namespace    http://tampermonkey.net/
// @version      2024-06-02
// @description  try to take over the world!
// @author       You
// @match        *://*/*
// @icon         https://www.google.com/s2/favicons?sz=64&domain=wikipedia.org
// @grant        none
// ==/UserScript==


const kanjiRegex = /[\u4e00-\u9faf]|[\u3400-\u4dbf]/

/**
 *
 * @param {Element} el
 * @param {*} cb
 */
function textNodesUnder(el, cb) {
  const children = [] // Type: Node[]
  const walker = document.createTreeWalker(el, NodeFilter.SHOW_TEXT)
  while(walker.nextNode()) {
    // children.push(walker.currentNode)
    if (kanjiRegex.test(walker.currentNode.textContent))
      cb(walker.currentNode)
  }
  // return children
}

const stats = {
  N5: 0,
  N4: 0,
  N3: 0,
  N2: 0,
  N1: 0
}



/**
 *
 * @param {Node} node
 */
function replaceAll(node) {
  for (let i = 0; i < node.textContent.length; i++) {
    const text = node.textContent
    const c = String.fromCodePoint(text.codePointAt(i))
    for (const [lvl, col, chars] of colorTable) {
      if (!chars.includes(c)) continue

      const text1 = text.substring(0, i)
      const text2 = text.substring(i + 1)
      const node1 = document.createTextNode(text1)
      node.textContent = text2
      node.parentNode?.insertBefore(node1, node)

      const e = document.createElement("span")
      e.style.color = "white"
      e.style.backgroundColor = col
      e.textContent = c
      node.parentNode?.insertBefore(e, node)

      stats[lvl] += 1
      i = -1
      break
    }
  }
}

const colorTable = [
  [
    "N5", "#ca8a04", '今来三木月六天友土手北父人店万新読少社校女円言語五長空半水前間見千十時古多東魚年駅目右九書休上中国足四白飲買本下道学電出雨高生毎西子名気行聞山口小火日七耳母安立二左金食男車入大花川外百午分会話一週南何先八後'
  ],
  [
    "N4", "#15803d", '近同海色英明去服物住切方歌送転計文止仕妹心顔弱界夜鳥始帰乗洋研待注考特門回事使漢建員兄屋森走真市病重引験牛究不用品発説工勉料室寒館夕池運通首所字着体広代以親借強地冬声知低集業教青族悪映働紙場力京質歩暗医飯遠都銀町院旅題秋昼早春貸田光夏民売便短答画味終進薬県暑理問写自作度死産音風頭試開好村意菜洗者正弟黒茶犬主有私曜起元楽堂家肉急台持赤朝思習太図別軽世野姉動区合林'
  ],
  [
    "N3", "#f97316", '泳板改鏡続望数希径湯類氷司唱票練席粉浅畑加械対灯量笛散曲記挙飛島紀細伝節球士悲係勝機昨共秒虫相倍浴指兆残絵里商郡王課貨鳴議戦停等然位組笑漁美宮号拾陽末管次帯史祝庭反皿成汽様季景油実変岸億船局丁速形隊害命活整筆神横差省想念束配投毛脈路例栄輪童健未和直結表冷深案谷置付線孫得型氏玉柱登標周材関失客受当弓典矢歯参囲卒植殺草各帳追守信令両全梅巣助息決竹候返番角札君港果街包約橋雲陸腸治刀要部折老良衣葉宿第固印養打仲必寺勇晴臣児列旗利流苦戸昭兵算園感波選面極身交農辞塩照官徒競期丸胃連航欠的馬化達芸酒根消側初察努給詩功温公貯祭博焼愛喜才麦階無坂覚鼻福荷育調象役器倉歴順章央泣府星訓静積軍向糸由点牧箱式願庫米底副皮豆落委内労申血湖緑録単賞具敗石級幸争定科炭平満松費礼観熱放鉄談種他法羊雪辺刷清完康芽昔黄最貝求救羽岩夫協負予遊州原取告毒'
  ],
  [
    "N2", "#9d174d", '独脳築鋭庁批畳永胸震詞浮破掃降暴遅叫罪備郵戻被狭犯純招喫肯著傾領燃供翌寄頼適蔵均久展河掘優額蒸銅責般暮軒略濯製枝歳居乾吹導状訪了踊吸易途職紹認曇精採条郊寝宅違込抜能卵在個況貧程税御性床署捜疲現論爆座封率営革触党値怖湿彼伺依齢硬匹零再政髪仏換件将坊制腕膚増尊恋与賃娘募則押績演限効劇雇準耕否駐規留筒呼余婦突裏溶机迷姓務絡幼涼旧承可祖臓泉涙除宇総域看査背測術似磨乱殿並復宝猫慣普基富燥鈍城巨綿暖述逆隅湾善非互粒刻刺律偶探財奥誌更盗険含疑応勢層挟恵緒凍越超像畜忘伸価快任冊塗割欲咲若幅痛占資泊泥版造評情塔詰針乳境骨恐枯圧減婚柔符示迎退到識構賢保恥経因判賛担較存操誤辛容舟埋灰捨仮拡済故装確断報複検敬逃悩諸祈偉異団眠棒双舞貿煙預鉱昇雑技専販困倒妻替宙払療沸収処輸帽簡拝濃設格張師権授券移憎忙液難届志汚珍危防補豊甘腹厚晩過肌肩解皆閉段脂沈絶警布香際混頂編勤滴枚荒片巻薄亡砂延欧杯贈講靴渡支怒接菓腰環損刊紅召禁夢修許武窓干常袋群比抱汗介軟捕壁'
  ],
  [
    "N1", "#e879f9", '亜哀挨曖握扱宛嵐威為畏尉萎椅彙維慰遺緯壱逸茨芋咽姻淫陰隠韻唄鬱畝浦詠影衛疫益悦謁閲沿炎怨宴媛援猿鉛縁艶凹往旺殴桜翁岡憶臆虞乙俺卸恩穏佳苛架華渦嫁暇禍寡箇稼蚊牙瓦我賀雅餓戒怪拐悔塊楷潰壊懐諧劾崖涯慨蓋該概骸垣柿核殻郭隔閣獲嚇穫岳顎掛潟括喝渇葛滑褐轄且株釜鎌刈缶肝冠陥勘患貫喚堪敢棺款閑勧寛幹歓監緩憾還韓艦鑑玩眼頑企伎岐忌奇軌既飢鬼亀幾揮棋貴棄毀畿輝騎宜偽欺義儀戯擬犠菊吉却脚虐及丘朽臼糾嗅窮拒拠虚距凶狂享峡恭脅郷矯響驚仰暁凝巾斤菌琴筋僅緊錦謹襟吟句駆惧愚遇串屈窟熊繰勲薫刑系茎契啓掲渓蛍携継詣慶憬稽憩鶏鯨隙撃激桁穴傑潔倹兼剣拳圏堅嫌献絹遣憲謙鍵繭顕懸幻玄弦舷源厳己股虎孤弧誇鼓錮顧呉娯悟碁護勾孔巧甲后江坑孝抗攻拘侯恒洪皇貢控梗喉慌絞項溝綱酵稿興衡鋼購乞拷剛傲豪克穀酷獄駒頃昆恨痕紺魂墾懇佐沙唆詐鎖挫災采砕宰栽彩斎裁債催塞載埼剤崎削柵索策酢搾錯刹拶撮擦桟蚕惨傘酸斬暫旨至祉肢姿施恣視紫嗣飼雌摯賜諮侍滋慈磁餌璽鹿軸𠮟疾執嫉漆芝舎射赦斜煮遮謝邪蛇尺酌釈爵寂朱狩殊珠腫趣寿呪需儒樹囚秀宗臭袖羞就衆愁酬醜蹴襲汁充従渋銃獣縦叔淑粛縮塾熟俊瞬旬巡盾准殉循潤遵庶如序叙徐升匠抄肖尚沼宵症祥称渉訟掌晶焦硝粧詔証傷奨詳彰障憧衝償礁鐘丈冗浄剰縄壌嬢錠譲醸拭殖飾嘱織辱尻芯侵津唇娠振浸紳診慎審薪刃仁尽迅甚陣尋腎須垂炊帥粋衰推酔遂睡穂随髄枢崇据杉裾寸瀬是井征斉牲凄逝盛婿聖誠誓請醒斥析脊隻惜戚跡籍拙窃摂舌仙宣染扇栓旋煎羨腺詮践箋銭潜遷薦繊鮮禅漸膳繕狙阻租素措粗疎訴塑遡礎壮奏荘挿桑曹曽爽創喪痩葬僧遭槽踪霜騒藻即促捉俗属賊遜汰妥唾堕惰駄耐怠胎泰堆逮滞態戴滝択沢卓拓託諾濁但脱奪棚誰丹旦胆淡嘆端綻誕鍛弾壇致痴稚緻逐蓄秩窒嫡沖忠抽衷酎鋳弔挑彫眺釣貼跳徴嘲潮澄聴懲勅捗朕陳鎮椎墜塚漬坪爪鶴呈廷抵邸亭貞帝訂逓偵堤提艇締諦摘敵溺迭哲徹撤添塡斗吐妬賭奴唐桃討透悼陶搭棟痘統稲踏糖謄藤闘騰洞胴瞳峠匿督徳篤栃凸屯豚頓貪丼那奈梨謎鍋尼弐匂虹尿妊忍寧捻粘納把派覇婆罵肺俳排廃輩培陪媒賠伯拍迫剝舶漠縛箸鉢伐罰閥氾帆汎伴阪班畔斑搬煩頒範繁藩蛮盤妃披肥卑秘扉碑罷避尾眉微膝肘泌姫俵漂苗描浜賓頻敏瓶扶阜附訃赴腐敷賦譜侮伏覆紛雰噴墳憤奮丙併柄陛塀幣弊蔽餅璧癖蔑偏遍弁哺舗墓慕簿芳邦奉泡胞俸倣峰砲崩蜂飽褒縫乏妨房肪某冒剖紡傍貌膨謀頰朴睦僕墨撲没勃堀奔翻凡盆麻摩魔昧幕膜枕又抹慢漫魅岬密蜜妙矛霧冥盟銘滅免麺茂模妄盲耗猛網黙紋冶弥厄訳躍闇喩愉諭癒唯幽悠湧猶裕雄誘憂融誉妖庸揚揺瘍窯擁謡抑沃翼拉裸羅雷酪辣覧濫藍欄吏痢履璃離慄柳竜隆硫侶虜慮猟陵僚寮瞭糧厘倫隣臨瑠累塁励鈴霊隷麗暦劣烈裂廉錬呂炉賂露弄郎朗浪廊楼漏籠麓賄脇惑枠'
  ]
]


textNodesUnder(document.body, replaceAll)